/*******************************************************************************
* INTEL CONFIDENTIAL
* Copyright 2010 Intel Corporation All Rights Reserved
*
* The source code contained or described herein and all documents related to the
* source code ("Material") are owned by Intel Corporation or its suppliers or
* licensors. Title to the Material remains with Intel Corporation or its
* suppliers and licensors. The Material contains trade secrets and proprietary
* and confidential information of Intel or its suppliers and licensors. The
* Material is protected by worldwide copyright and trade secret laws and treaty
* provisions. No part of the Material may be used, copied, reproduced, modified,
* published, uploaded, posted, transmitted, distributed, or disclosed in any way
* without Intel's prior express written permission.
*
* No license under any patent, copyright, trade secret or other intellectual
* property right is granted to or conferred upon you by disclosure or delivery
* of the Materials, either expressly, by implication, inducement, estoppel or
* otherwise. Any license under such intellectual property rights must be express
* and approved by Intel in writing.
*
*******************************************************************************/


//
// General Purpose Strings
//
"Yes" = "Yes";
"No" = "No";
"Unknown" = "Unknown";


//
// Feature Tab Strings
//

// SIMD FP Features
"FeatureShortNameMXFP_00000040" = "DAZ";
"FeatureShortNameMXFP_00008000" = "FTZ";


//
// Cache Tab Strings
//

// Cache Type
"CacheType00" = "Null";
"CacheType01" = "Data";
"CacheType02" = "Instruction";
"CacheType03" = "Unified";
"CacheType04" = "Unknown";
"CacheType05" = "Unknown";
"CacheType06" = "Unknown";
"CacheType07" = "Unknown";

"CacheIndex00" = "Null descriptor";
"CacheIndex01" = "Instruction TLB: 4 KByte Pages, 4-way set associative, 32 entries";
"CacheIndex02" = "Instruction TLB: 4 MByte Pages, 4-way set associative, 2 entries";
"CacheIndex03" = "Data TLB: 4 KByte Pages, 4-way set associative, 64 entries";
"CacheIndex04" = "Data TLB: 4 MByte Pages, 4-way set associative, 8 entries";
"CacheIndex05" = "Data TLB1: 4 MByte Pages, 4-way set associative, 32 entries";
"CacheIndex06" = "1st-level instruction cache: 8 KBytes, 4-way set associative, 32 byte line size";
"CacheIndex08" = "1st-level instruction cache: 16 KBytes, 4-way set associative, 32 byte line size";
"CacheIndex09" = "1st-level instruction cache: 32 KBytes, 4-way set associative, 64 byte line size";
"CacheIndex0A" = "1st-level data cache: 8 KBytes, 2-way set associative, 32 byte line size";
"CacheIndex0B" = "Instruction TLB: 4 MByte pages, 4-way set associative, 4 entries";
"CacheIndex0C" = "1st-level data cache: 16 KBytes, 4-way set associative, 32 byte line size";
"CacheIndex0D" = "1st-level data cache: 16 KBytes, 4-way set associative, 64 byte line size";			
"CacheIndex0E" = "1st-level data cache: 24 KBytes, 6-way set associative, 64 byte line size";			
"CacheIndex1D" = "2nd-level cache: 128 KBytes, 2-way set associative, 64 byte line size";		// new
"CacheIndex21" = "2nd-level cache: 256 KBytes, 8-way set associative, 64 byte line size";				
"CacheIndex22" = "3rd-level cache: 512 KBytes, 4-way set associative, 64 byte line size, 2 lines per sector";
"CacheIndex23" = "3rd-level cache: 1 MBytes, 8-way set associative, 64 byte line size, 2 lines per sector";
"CacheIndex24" = "2nd-level cache: 1 MBytes, 16-way set associative, 64 byte line size";		// new
"CacheIndex25" = "3rd-level cache: 2 MBytes, 8-way set associative, 64 byte line size, 2 lines per sector";
"CacheIndex29" = "3rd-level cache: 4 MBytes, 8-way set associative, 64 byte line size, 2 lines per sector";
"CacheIndex2C" = "1st-level data cache: 32 KBytes, 8-way set associative, 64 byte line size";
"CacheIndex30" = "1st-level instruction cache: 32 KBytes, 8-way set associative, 64 byte line size";
"CacheIndex40" = "No 2nd-level cache or, if processor contains a valid 2nd-level cache, no 3rd-level cache";
"CacheIndex41" = "2nd-level cache: 128 KBytes, 4-way set associative, 32 byte line size";
"CacheIndex42" = "2nd-level cache: 256 KBytes, 4-way set associative, 32 byte line size";
"CacheIndex43" = "2nd-level cache: 512 KBytes, 4-way set associative, 32 byte line size";
"CacheIndex44" = "2nd-level cache: 1 MByte, 4-way set associative, 32 byte line size";
"CacheIndex45" = "2nd-level cache: 2 MByte, 4-way set associative, 32 byte line size";
"CacheIndex46" = "3rd-level cache: 4 MByte, 4-way set associative, 64 byte line size";
"CacheIndex47" = "3rd-level cache: 8 MByte, 8-way set associative, 64 byte line size";
"CacheIndex48" = "2nd-level cache: 3 MByte, 12-way set associative, 64 byte line size";		
"CacheIndex49" = "2nd-level cache: 4 MByte, 16-way set associative, 64 byte line size";
"CacheIndex4A" = "3rd-level cache: 6 MByte, 12-way set associative, 64 byte line size";
"CacheIndex4B" = "3rd-level cache: 8 MByte, 16-way set associative, 64 byte line size";
"CacheIndex4C" = "3rd-level cache: 12 MByte, 12-way set associative, 64 byte line size";
"CacheIndex4D" = "3rd-level cache: 16 MByte, 16-way set associative, 64 byte line size";
"CacheIndex4E" = "2nd-level cache: 6 MByte, 24-way set associative, 64 byte line size";
"CacheIndex4F" = "Instruction TLB: 4 KByte pages, 32 entries";								
"CacheIndex50" = "Instruction TLB: 4 KByte and 2-MByte or 4-MByte pages, 64 entries";
"CacheIndex51" = "Instruction TLB: 4 KByte and 2-MByte or 4-MByte pages, 128 entries";
"CacheIndex52" = "Instruction TLB: 4 KByte and 2-MByte or 4-MByte pages, 256 entries";
"CacheIndex55" = "Instruction TLB: 2-MByte or 4-MByte pages, fully associative, 7 entries";		
"CacheIndex56" = "Data TLB0: 4 MByte pages, 4-way set associative, 16 entries";
"CacheIndex57" = "Data TLB0: 4 KByte pages, 4-way set associative, 16 entries";
"CacheIndex59" = "Data TLB0: 4 KByte, fully associative, 16 entries";							
"CacheIndex5A" = "Data TLB0: 2 MByte and 4 MByte pages, 4-way set associative, 32 entries";		
"CacheIndex5B" = "Data TLB: 4 KByte and 4 MByte pages, 64 entries";
"CacheIndex5C" = "Data TLB: 4 KByte and 4 MByte pages,128 entries";
"CacheIndex5D" = "Data TLB: 4 KByte and 4 MByte pages,256 entries";
"CacheIndex60" = "1st-level data cache: 16 KByte, 8-way set associative, 64 byte line size";
"CacheIndex61" = "Instruction TLB: 4 KByte pages, fully associative, 48 entries"; // new
"CacheIndex63" = "Data TLB: 2 MByte or 4 MByte pages, 4-way set associative, 32 entries and a separate array with 1 GByte pages, 4-way set associative, 4 entries"; // new
"CacheIndex64" = "Data TLB: 4 KByte pages, 4-way set associative, 512 entries"; // new
"CacheIndex66" = "1st-level data cache: 8 KByte, 4-way set associative, 64 byte line size";
"CacheIndex67" = "1st-level data cache: 16 KByte, 4-way set associative, 64 byte line size";
"CacheIndex68" = "1st-level data cache: 32 KByte, 4-way set associative, 64 byte line size";
"CacheIndex6A" = "uTLB: 4 KByte pages, 8-way set associative, 64 entries"; // new
"CacheIndex6B" = "DTLB: 4 KByte pages, 8-way set associative, 256 entries"; // new
"CacheIndex6C" = "DTLB: 2M/4M pages, 8-way set associative, 128 entries"; // new
"CacheIndex6D" = "DTLB: 1 GByte pages, fully associative, 16 entries"; // new
"CacheIndex70" = "Trace cache: 12 K-μop, 8-way set associative";
"CacheIndex71" = "Trace cache: 16 K-μop, 8-way set associative";
"CacheIndex72" = "Trace cache: 32 K-μop, 8-way set associative";
"CacheIndex76" = "Instruction TLB: 2M/4M pages, fully associative, 8 entries"; // new
"CacheIndex78" = "2nd-level cache: 1 MByte, 4-way set associative, 64byte line size";
"CacheIndex79" = "2nd-level cache: 128 KByte, 8-way set associative, 64 byte line size, 2 lines per sector";
"CacheIndex7A" = "2nd-level cache: 256 KByte, 8-way set associative, 64 byte line size, 2 lines per sector";
"CacheIndex7B" = "2nd-level cache: 512 KByte, 8-way set associative, 64 byte line size, 2 lines per sector";
"CacheIndex7C" = "2nd-level cache: 1 MByte, 8-way set associative, 64 byte line size, 2 lines per sector";
"CacheIndex7D" = "2nd-level cache: 2 MByte, 8-way set associative, 64byte line size";
"CacheIndex7F" = "2nd-level cache: 512 KByte, 2-way set associative, 64-byte line size";
"CacheIndex80" = "2nd-level cache: 512 KByte, 8-way set associative, 64 byte line size";
"CacheIndex82" = "2nd-level cache: 256 KByte, 8-way set associative, 32 byte line size";
"CacheIndex83" = "2nd-level cache: 512 KByte, 8-way set associative, 32 byte line size";
"CacheIndex84" = "2nd-level cache: 1 MByte, 8-way set associative, 32 byte line size";
"CacheIndex85" = "2nd-level cache: 2 MByte, 8-way set associative, 32 byte line size";
"CacheIndex86" = "2nd-level cache: 512 KByte, 4-way set associative, 64 byte line size";
"CacheIndex87" = "2nd-level cache: 1 MByte, 8-way set associative, 64 byte line size";
"CacheIndexA0" = "DTLB: 4k pages, fully associative, 32 entries"; // new
"CacheIndexB0" = "Instruction TLB: 4 KByte Pages, 4-way set associative, 128 entries";
"CacheIndexB1" = "Instruction TLB: 2 MByte Pages, 4-way, 8 entries or 4 Mbyte pages, 4-way, 4 entries";
"CacheIndexB2" = "Instruction TLB: 4 KByte Pages, 4-way set associative, 64 entries";							
"CacheIndexB3" = "Data TLB: 4 KByte Pages, 4-way set associative, 128 entries";
"CacheIndexB4" = "Data TLB1: 4 KByte Pages, 4-way set associative, 256 entries";
"CacheIndexB5" = "Instruction TLB: 4KByte pages, 8-way set associative, 64 entries"; // new
"CacheIndexB6" = "Instruction TLB: 4KByte pages, 8-way set associative, 128 entries"; // new
"CacheIndexBA" = "Data TLB1: 4 KByte pages, 4-way associative, 64 entries"; // new
"CacheIndexC0" = "Data TLB: 4 KByte and 4 MByte pages, 4-way associative, 8 entries";
"CacheIndexC1" = "Shared 2nd-Level TLB: 4 KByte/2MByte pages, 8-way associative, 1024 entries"; // new
"CacheIndexC2" = "DTLB: 4 KByte/2 MByte pages, 4-way associative, 16 entries"; // new
"CacheIndexC3" = "Shared 2nd-Level TLB: 4 KByte /2 MByte pages, 6-way associative, 1536 entries. Also 1GBbyte pages, 4-way, 16 entries."; // new
"CacheIndexC4" = "DTLB: 2M/4M Byte pages, 4-way associative, 32 entries"; // new
"CacheIndexCA" = "Shared 2nd-Level TLB: 4 KByte pages, 4-way associative, 512 entries";
"CacheIndexD0" = "3rd-level cache: 512 KByte, 4-way set associative, 64 byte line size"; // new
"CacheIndexD1" = "3rd-level cache: 1 MByte, 4-way set associative, 64 byte line size"; // new
"CacheIndexD2" = "3rd-level cache: 2 MByte, 4-way set associative, 64 byte line size"; // new
"CacheIndexD6" = "3rd-level cache: 1 MByte, 8-way set associative, 64 byte line size"; // new
"CacheIndexD7" = "3rd-level cache: 2 MByte, 8-way set associative, 64 byte line size"; // new
"CacheIndexD8" = "3rd-level cache: 4 MByte, 8-way set associative, 64 byte line size"; // new
"CacheIndexDC" = "3rd-level cache: 1.5 MByte, 12-way set associative, 64 byte line size"; // new
"CacheIndexDD" = "3rd-level cache: 3 MByte, 12-way set associative, 64 byte line size"; // new
"CacheIndexDE" = "3rd-level cache: 6 MByte, 12-way set associative, 64 byte line size"; // new
"CacheIndexE2" = "3rd-level cache: 2 MByte, 16-way set associative, 64 byte line size"; // new
"CacheIndexE3" = "3rd-level cache: 4 MByte, 16-way set associative, 64 byte line size"; // new
"CacheIndexE4" = "3rd-level cache: 8 MByte, 16-way set associative, 64 byte line size";	
"CacheIndexEA" = "3rd-level cache: 12MByte, 24-way set associative, 64 byte line size";	
"CacheIndexEB" = "3rd-level cache: 18MByte, 24-way set associative, 64 byte line size";	
"CacheIndexEC" = "3rd-level cache: 24MByte, 24-way set associative, 64 byte line size";
"CacheIndexF0" = "64-Byte Prefetching";
"CacheIndexF1" = "128-Byte Prefetching";
"CacheIndexFF" = "CPUID leaf 2 does not report TLB descriptor information; use CPUID leaf 18H to query TLB and other address translation parameters.";	
"CacheIndexFF" = "CPUID leaf 2 does not report cache descriptor information, use CPUID leaf 4 to query cache parameters";	

//
// Miscellaneous Tab Strings
//
"MiscThreads" = "Processor Threads";
"MiscLogicals" = "Logical Processors per Package";
"MiscCores" = "Cores per Physical Package";
"MiscLogsCore" = "Logical Processors per Core";
"MiscMMLeaf" = "Monitor/MWait Leaf";
"MiscMMLeafMin" = "Smallest Line Size (Bytes)";
"MiscMMLeafMax" = "Largest Line Size (Bytes)";
"MiscMMLeafInt" = "Interrupts Treated as Break-Event";
"MiscMMLeafC0" = "Number of C0 Sub-States Supported";
"MiscMMLeafC1" = "Number of C1 Sub-States Supported";
"MiscMMLeafC2" = "Number of C2 Sub-States Supported";
"MiscMMLeafC3" = "Number of C3 Sub-States Supported";
"MiscMMLeafC4" = "Number of C4 Sub-States Supported";
"MiscMMLeafC5" = "Number of C5 Sub-States Supported";
"MiscMMLeafC6" = "Number of C6 Sub-States Supported";
"MiscMMLeafC7" = "Number of C7 Sub-States Supported";
"MiscPowerLeaf" = "Thermal & Power Management Leaf";
"MiscPowerTurboBoost" = "Intel Turbo Boost Technology";
"MiscPowerARAT" = "APIC-Timer-Always-Running";
"MiscPowerPLN" = "Power Limit Notification Controls";
"MiscPowerECMD" = "Clock Modulation Duty Cycle Extension";
"MiscPowerPTM" = "Package Thermal Management";
"MiscPowerHWP" = "Hardware Performance States (HWP)";
"MiscPowerHWP_Notification" = "HWP Notification";
"MiscPowerHWP_Activity_Window" = "HWP Activity Window";
"MiscPowerHWP_Energy_Performance_Preference" = "HWP Energy Performance Preference";
"MiscPowerHWP_Package_Level_Request" = "HWP Package Level Request";
"MiscPowerHDC" = "Hardware Duty Cycling";
"MiscPowerTurboBoost3_0" = "Intel Turbo Boost Max Technology 3.0";
"MiscPowerInterruptThresholds" = "Number of Interrupt Thresholds";
"MiscPowerACNTMCNT" = "ACNT/MCNT Support";
"MiscPowerPerformanceEnergyBias" = "Performance-Energy Bias Preference";
"MiscAddrSize" = "Address Sizes";
"MiscPhysical" = "Physical Address (GB)";
"MiscLogical" = "Logical Address (GB)";


//
// Architectural Performance Monitoring Tab Strings
//

// When adding more events update the MAXKNOWNPERFEVENTS define in Cpuid.h to the new count.
"PerfEvent_00000001" = "Core Cycles";
"PerfEvent_00000002" = "Instructions Retired";
"PerfEvent_00000004" = "Reference Cycles";
"PerfEvent_00000008" = "Last-Level Cache Reference";
"PerfEvent_00000010" = "Last-Level Cache Misses";
"PerfEvent_00000020" = "Branch Instructions Retired";
"PerfEvent_00000040" = "Branch Mispredict Instructions Retired";
